set_property PACKAGE_PIN AR13 [get_ports rfdc_one_adc_4096gsps_gpio_led_ext[0]]
set_property IOSTANDARD LVCMOS18 [get_ports rfdc_one_adc_4096gsps_gpio_led_ext[0]]
set_property PACKAGE_PIN AV15 [get_ports rfdc_one_adc_4096gsps_gpio_led1_ext[0]]
set_property IOSTANDARD LVCMOS18 [get_ports rfdc_one_adc_4096gsps_gpio_led1_ext[0]]
set_property PACKAGE_PIN AL16 [get_ports clk_100_p]
set_property IOSTANDARD LVDS [get_ports clk_100_p]
create_clock -period 7.812 -name clk_100_p -waveform {0.000 3.906} [get_ports {clk_100_p}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins zcu111_infr_inst/user_clk_mmcm_inst/CLKOUT0]] -group [get_clocks -of_objects [get_pins zcu111_inst/zynq_ultra_ps_e_0/U0/PS8_i/PLCLK[0]]]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins zcu111_inst/zynq_ultra_ps_e_0/U0/PS8_i/PLCLK[0]]] -group [get_clocks -of_objects [get_pins zcu111_infr_inst/user_clk_mmcm_inst/CLKOUT0]]
set_max_delay 1.0 -to [get_ports {rfdc_one_adc_4096gsps_gpio_led_ext[*]}]
set_max_delay 1.0 -to [get_ports {rfdc_one_adc_4096gsps_gpio_led1_ext[*]}]
set_min_delay 1.0 -to [get_ports {rfdc_one_adc_4096gsps_gpio_led_ext[*]}]
set_min_delay 1.0 -to [get_ports {rfdc_one_adc_4096gsps_gpio_led1_ext[*]}]
set_false_path -to [get_ports {rfdc_one_adc_4096gsps_gpio_led_ext[*]}]
set_false_path -to [get_ports {rfdc_one_adc_4096gsps_gpio_led1_ext[*]}]
